# Week 7 Lab: Data Cleaning
This week we are going to clean up and practice some selection and filtering operations on the [Titanic](https://www.kaggle.com/c/titanic/data) dataset that is famous in code challenges.

The dataset contains the following columns and codes:

| Variable | Definition                                 | Key                                            |
|----------|--------------------------------------------|------------------------------------------------|
| survival | Survival                                   | 0 = No, 1 = Yes                                |
| pclass   | Ticket class                               | 1 = 1st, 2 = 2nd, 3 = 3rd                      |
| sex      | Sex                                        |                                                |
| Age      | Age in years                               |                                                |
| sibsp    | # of siblings / spouses aboard the Titanic |                                                |
| parch    | # of parents / children aboard the Titanic |                                                |
| ticket   | Ticket number                              |                                                |
| fare     | Passenger fare                             |                                                |
| cabin    | Cabin number                               |                                                |
| embarked | Port of Embarkation                        | C = Cherbourg, Q = Queenstown, S = Southampton |

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [14]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Task 1
How many missing values are there in each column?

In [1]:
# Write your code here

## Task 2
Create a histogram to display the distribution of fares paid

In [3]:
# Write your code here

## Task 3
What are the unique values inside the `Cabin` column?

You can find out more about the cabins on [Encyclopedia Titanica](https://www.encyclopedia-titanica.org/cabins.html)

In [4]:
# Write your code here

## Task 4
- Create a new column called `Deck` that contains only the first letter from the `Cabin` column. You will need a string slice or the [get](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.str.get.html#) method to extract the date to create this new column.

In [5]:
# Write your code here

## Task 5
How many people stayed on each deck?

In [6]:
# Write your code here

## Task 6
Plot a histogram to show the distribution of ages of female passengers

In [7]:
# Write your code here

## Task 7
Replace the `Embarked` column with their respective port names. `C` = Cherbourg, `Q` = Queenstown, `S` = Southampton

In [8]:
# Write your code here

## Task 8
How many people got on from each port?

In [9]:
# Write your code here

## Task 9
Create a plot that would let us see the median and interquartile range of the **ages** of the passengers as well as the ouliers.

In [10]:
# Write your code here

## Task 10
Create an `AgeGroup` column which bins the following `Age`:

- 0 - 12   : Child
- 13 - 25  : Young Adult
- 26 - 50  : Adult
- 51 - 100 : Senior

Then count how many were in each category

In [11]:
# Write your code here